Revit 2024 API
PointCloudInstance.GetRegions Method
 Returns array of region names.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public IList<string> GetRegions()
Visual Basic
Public Function GetRegions As IList(Of String)
Visual C++
public:
IList<String^>^ GetRegions()
Return Value
 Resulting array of region names.
See Also
PointCloudInstance Class
Autodesk.Revit.DB Namespace